In [1]:
import pandas as pd

In [3]:
print(pd.__version__)

2.0.3

# Series Query, Manupilate, Delete

# Creating a series from list

In [7]:
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [21]:
import pandas as pd
order=[1,2,3,4,5]
s2=pd.Series(arr, index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [23]:
import numpy as np
n=np.random.randn(5) #Create a random Ndarray
n

array([ 0.28358582,  0.92933886, -0.33868423, -0.45688796,  0.06866855])

In [3]:
import numpy as np
import pandas as pd
n=np.random.randn(5) #Create a random Ndarray
index=['a','b','c','d','e']
s2=pd.Series(n, index=index)
s2

a   -0.443405
b    0.329205
c    1.311201
d    0.342928
e   -1.106784
dtype: float64

# Create a Series from a Dictionary

In [4]:
d={'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
s3= pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

# Modifying index of Series

In [8]:
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1.index=['A','B','C','D','E']
print(s1)

A    0
B    1
C    2
D    3
E    4
dtype: int64

# Slicing

In [11]:
s1[:3]

A    0
B    1
C    2
dtype: int64

In [13]:
s1[-2:]

D    3
E    4
dtype: int64

In [15]:
s4=s1.append(s3)
s4

AttributeError: 'Series' object has no attribute 'append'

In [16]:
s4.drop('e')

NameError: name 's4' is not defined

# Series Operations

In [17]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,8,9,5]
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [19]:
s6=pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [20]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [21]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [22]:
s5.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [23]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [24]:
print('median', s6.median())
print('max', s6.max())
print('min', s6.min())

median 3.0
max 7
min 0

In [26]:
s7=s5.mul(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [27]:
print('median', s7.median())
print('max', s7.max())
print('min', s7.min())

median 16.0
max 27.0
min 0.0

# Create Dataframe

In [28]:
dates=pd.date_range('today', periods=6)#Define time sequence as index
dates

DatetimeIndex(['2024-04-19 13:36:39.242374', '2024-04-20 13:36:39.242374',
               '2024-04-21 13:36:39.242374', '2024-04-22 13:36:39.242374',
               '2024-04-23 13:36:39.242374', '2024-04-24 13:36:39.242374'],
              dtype='datetime64[ns]', freq='D')

In [30]:
num_arr=np.random.randn(6,4)#Import numpy random array
num_arr

array([[ 0.72818927,  1.4125975 , -0.57733445,  1.35654415],
       [-2.85058828, -0.71950672,  0.4290292 , -0.26757514],
       [ 0.86413368,  1.15874048, -1.16414439, -0.63845025],
       [ 0.91993533,  1.25410605, -0.93869   ,  1.03139813],
       [ 0.39237116,  0.5435631 ,  0.74713683,  0.58643333],
       [-1.87429862,  1.7763176 ,  0.25959776,  0.86780367]])

In [32]:
columns= ['A','B','C','D']
columns

['A', 'B', 'C', 'D']

In [37]:
dates=pd.date_range('today', periods=6)#Define time sequence as index
num_arr=np.random.randn(6,4)#Import numpy random array
columns= ['A','B','C','D'] #Use the table as the column name
df1= pd.DataFrame(num_arr, index=dates, columns=columns)
print(df1)

                                   A         B         C         D
2024-04-19 13:53:58.440437  2.274350  0.942031  2.420546 -0.536911
2024-04-20 13:53:58.440437  0.506538 -0.041004  0.801766 -1.318684
2024-04-21 13:53:58.440437  1.203677  0.582702  1.119579 -0.768623
2024-04-22 13:53:58.440437  0.391046  0.500535 -0.948436  0.532804
2024-04-23 13:53:58.440437  0.240302  0.061274 -0.375836  0.070551
2024-04-24 13:53:58.440437  1.109872  1.138322  0.368047 -1.045956

In [38]:
# Create dataframe with dictionary array

In [82]:
data= {'animal':['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
    'age':[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
      'visits':[1,3,2,3,2,3,1,1,2,1],
      'priority':['yes','yes','no','yes','no','no','no','yes','no','no']}
labels=['a','b','c','d','e','f','g','h','i','j']
df2= pd.DataFrame(data, index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [51]:
#See data types of array

In [52]:
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [53]:
df2.head()

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no

In [54]:
df2.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [58]:
df2.index
df2.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [60]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'no'],
       ['cat', 2.0, 3, 'no'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [61]:
df2.describe() #See statistical data of dataframe

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [62]:
df2.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [63]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [64]:
#Slicing dataframe

In [66]:
df2[1:4]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

In [68]:
df2.sort_values(by='age')[1:4]

  animal  age  visits priority
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes

In [83]:
#Query dataframe by tag
df2[['age','visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [84]:
df2.iloc[1:4]

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

In [120]:
df3=df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [86]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [103]:
df3.loc['f','age']=1.5
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [96]:
df3['visits'].sum()

19

In [97]:
df3.sum()

animal      catcatsnakedogdogcatsnakecatdogdog
age                                       27.0
visits                                      19
priority              yesyesnoyesnononoyesnono
dtype: object

In [100]:
df3.max()

animal      snake
age           7.0
visits          3
priority      yes
dtype: object

# Operations for DataFrame Missing Values

In [107]:
df4=df3.copy()
meanAge=df4['age'].mean()
df4['age'].fillna(meanAge)

a    2.500
b    3.000
c    0.500
d    3.375
e    5.000
f    1.500
g    4.500
h    3.375
i    7.000
j    3.000
Name: age, dtype: float64

In [115]:
df5=df3.copy
df5

<bound method NDFrame.copy of   animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no>

import pandas as pd
df5=pd.read_df5
newdf5=df5.dropna ()

In [124]:
df5=df3.copy()
df5.dropna(how='any')

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

# DataFrame file operations

In [130]:
df3.to_csv('animal.csv')

In [126]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(3)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no

In [134]:
df3.to_excel('animal.xlsx',sheet_name='Sheet1')
df_animal2=pd.read_excel('animal.xlsx','Sheet1',index_col=None, na_values=['NA'])
print (df_animal2)

  Unnamed: 0 animal  age  visits priority
0          a    cat  2.5       1      yes
1          b    cat  3.0       3      yes
2          c  snake  0.5       2       no
3          d    dog  NaN       3      yes
4          e    dog  5.0       2       no
5          f    cat  2.0       3       no
6          g  snake  4.5       1       no
7          h    cat  NaN       1      yes
8          i    dog  7.0       2       no
9          j    dog  3.0       1       no